#include <stdio.h>


int main() {
    printf("เตรียมอุปกรณ์ครัว: กระทะ, ช้อน, ตะหลิว, เขียง, มีด, จาน\n") ;
    printf("เตรียมวัตถุดิบ: ข้าวสวย, หมูกรอบ, กระเพรา, พริก, กระเทียม, ซอสปรุงรส, ไข่เยี่ยวม้า\n") ;
    printf( "ทอดหมูกรอบจนเหลืองกรอบ\n" ) ;
    printf("ผัดกระเทียม + พริก จนหอม\n") ;
    printf("ใส่หมูกรอบลงผัดรวม\n") ;
    printf("ใส่ซอสปรุงรส ผัดให้เข้ากัน\n") ;
    printf("ใส่กระเพราผัดเร็วๆ 30 วินาที\n") ;
    printf("ใส่ข้าวสวยลงผัดรวมกับเครื่อง ปรุงรสตามชอบ\n") ;
    printf("ตักใส่จาน วางไข่เยี่ยวม้าด้านบน\n") ;
    return 0;
}
